current/app/controllers/admin/groupshows_controller.rb

  def show
    @groupshow = Groupshow.find(params[:id])
---
SELECT * FROM `groupshows` WHERE (`groupshows`.`id` = 3)

  def edit
    @groupshow = Groupshow.find(params[:id])
    @user_ids = []
    @places = Gallery.all
    sr = Role.find_by_name('artist')
		@artists = Profile.with_conditions_on_user({ :conditions => "users.system_role_id=#{sr.id}"}).all(:order => 'first_name ASC')
    usergroupshow = Usergroupshow.find(:all,:conditions=>["groupshow_id = ?",@groupshow.id])
    usergroupshow.each do |ugs| @user_ids << ugs.user_id end
    @period_id = Period.find_by_starting_date_and_ending_date(@groupshow.starting_date,@groupshow.ending_date);
---
SELECT * FROM `groupshows` WHERE (`groupshows`.`id` = 3)
SELECT * FROM `galleries`
SELECT * FROM `roles` WHERE (`roles`.`name` = 'artist') LIMIT 1
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 2) LIMIT 1
SELECT * FROM `usergroupshows` WHERE (groupshow_id = 3)
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT * FROM `periods` WHERE (`periods`.`ending_date` = '2009-11-11' AND `periods`.`starting_date` = '2009-11-03') LIMIT 1