current/app/controllers/admin/profiles_controller.rb

SELECT * FROM `profiles` WHERE (profiles.id > 0) ORDER BY first_name asc
---
  def index

     #@competitionuserenteredlist = CompetitionsUser.find(:all)
     @competitions = Competition.find(:all)


      if  current_user.login == "admin" || current_user.login == "superadmin"
		    @current_objects = Profile.superadmin_filtered.all(:order => 'first_name asc')

SELECT * FROM `profiles` WHERE (`profiles`.user_id = 46) LIMIT 1
SELECT * FROM `artworks` WHERE (user_id = 2 and exhibition_id = 46)
SELECT * FROM `messages` WHERE (`messages`.author_id = 46 AND (deletedm = 0 or deletedm is null)) ORDER BY created_at DESC LIMIT 0, 500
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT * FROM `competitions_users` WHERE (`competitions_users`.user_id = 46)
SELECT * FROM `artworks_competitions` WHERE (competitions_users_id != 'null') AND (`artworks_competitions`.competitions_users_id = 34)
SELECT * FROM `competitions` WHERE (`competitions`.`id` IN (55,56,57,58,60,59,51,52,53,54))
---
 def show

   if  current_user.login == "admin" || current_user.login == "superadmin"

    @current_object = Profile.find(params[:id])
    session[:exh_display_list] = params[:id]
    #@my_subscription = CompetitionsUser.find(:last);
    @artworkexhibition = Artwork.find(:all,:conditions=>["user_id = ? and exhibition_id = ?",@current_user.id,@current_object.id])
    #@folder = @current_object.user.inbox
    @messages = @current_object.user.sent_messages.paginate :conditions=>["deletedm = ? or deletedm is null",false], :per_page => 500, :page => params[:page], :order => "created_at DESC"
    #@messages = current_user.sent_messages.paginate :conditions=>["deletedm = ? or deletedm is null ",false], :per_page => 500, :page => params[:page], :order => "created_at DESC"
     @message_recd = []
    #above are the recd message and below are the sent message
    #adminuser = User.find_by_login("admin")
    @current_object.user.received_messages.each do |mc|
      @message_recd << mc.message
    end
    @exhartwork = Artwork.find(:all,:conditions=>["user_id = ?",params[:id]])
    comp_users = CompetitionsUser.find(:all,:conditions=>["user_id = ?",@current_object.id])
    id_list = []
    comp_users.each do |cu|
      id_list << cu.id
    end
    p id_list
    p "the total listtttt"
    p id_list.join(',')

    @all_comp_art_work = []
    if !id_list.join(',').blank?
    @all_comp_art_work = ArtworksCompetition.find(:all,:conditions=>["competitions_users_id in (#{id_list.join(',')})"])

SELECT * FROM `exhibitions_users` WHERE (`exhibitions_users`.`id` = 21)
SELECT * FROM `users` WHERE (`users`.`id` = 44) LIMIT 1
SELECT * FROM `invoices` WHERE (purchasable_type = 'ExhibitionsUser' and client_id = 44 and purchasable_id = 21 ) LIMIT 1
---
    def exhibition_payment_front

        alreadypaidamt = nil
        exhibitionuser = ExhibitionsUser.find(params[:id])
        @invoice = Invoice.find(:first,:conditions=>["purchasable_type = ? and  client_id = ?  and purchasable_id = ? ","ExhibitionsUser" , exhibitionuser.user,exhibitionuser.id])