current/app/controllers/admin/sessions_controller.rb

  def destroy
    User.find(current_user.id).update_attributes(:last_connected_at => Time.now)
---
SELECT * FROM `users` WHERE (`users`.`id` = 44) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-08-16 11:36:19', `last_connected_at` = '2011-08-16 17:06:19' WHERE `id` = 44