current/app/controllers/admin/users_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`name` = 'artist') LIMIT 1
SELECT `profiles`.id FROM `profiles` WHERE (`profiles`.`email_address` = BINARY 'contact23@test.com.au') LIMIT 1
SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'contact23@test.com.au') LIMIT 1
INSERT INTO `profiles` (`address`, `city`, `created_at`, `zip_code`, `country`, `updated_at`, `salutation`, `gender`, `birth_date`, `suburb`, `user_id`, `phone_number`, `last_name`, `website`, `notices`, `email_address`, `getting_newsletter`, `studios`, `first_name`, `middle_name`, `nationality`, `state`, `country_state`, `biography`) VALUES('address', NULL, '2011-08-18 09:00:21', '411038', 'ind', '2011-08-18 09:00:21', NULL, NULL, NULL, 'suburb', 68, '25420753', 'me', 'http://www.kedar.com', NULL, 'contact23@test.com.au', 0, NULL, 'contact', NULL, NULL, NULL, 'maha', NULL)
INSERT INTO `users` (`last_connected_at`, `u_layout`, `salt`, `avatar_file_name`, `avatar_file_size`, `activated_at`, `created_at`, `crypted_password`, `remember_token_expires_at`, `password_reset_code`, `updated_at`, `u_language`, `activation_code`, `avatar_content_type`, `remember_token`, `login`, `avatar_updated_at`, `u_per_page`, `system_role_id`, `email`, `state`) VALUES(NULL, NULL, '5fdb299480e1958bbf9ac754116fc2427769ec10', NULL, NULL, NULL, '2011-08-18 09:00:21', '63a601a2d7edf63f31291dbc4780d2d936c5a41a', NULL, NULL, '2011-08-18 09:00:21', NULL, '5ad93dea737382a4dd5488d9557ba3c9818ca299', NULL, NULL, 'c.meeFV', NULL, NULL, 8, 'contact23@test.com.au', NULL)
UPDATE `users` SET `updated_at` = '2011-08-18 09:00:21', `activated_at` = '2011-08-18 14:30:21', `login` = 'c.meeFV', `crypted_password` = '63a601a2d7edf63f31291dbc4780d2d936c5a41a', `salt` = '5fdb299480e1958bbf9ac754116fc2427769ec10', `created_at` = '2011-08-18 09:00:21', `activation_code` = '5ad93dea737382a4dd5488d9557ba3c9818ca299', `system_role_id` = 8, `email` = 'contact23@test.com.au' WHERE `id` = 68
INSERT INTO `workspaces` (`created_at`, `title`, `body`, `available_types`, `updated_at`, `logo_file_name`, `creator_id`, `description`, `logo_content_type`, `logo_file_size`, `state`, `available_items`) VALUES('2011-08-18 09:00:22', 'contact me workspace', 'It is the first workspace for contact me, it is where all his content will always be stock.', NULL, '2011-08-18 09:00:22', NULL, 68, 'Workspace containing all the content created by the user c.meeFV', NULL, NULL, 'private', 'artworks')
---
	def create
	admin_logged_in = false
     if logged_in?
 	    admin_logged_in=current_user
     end
	  @current_object = User.new(params[:user])
		@current_object.build_profile if @current_object.profile.nil?
		if (!current_user && is_allowed_free_user_creation?) || (current_user && @current_object.has_permission_for?('new', @current_user, current_container))
			if @current_object.login.nil?
			   @current_object.auto_login
			end
			@current_object.profile.email_address = @current_object.email if @current_object.profile
			@current_object.system_role_id = Role.find(:first, :conditions => { :name => 'competitor' }).id if !@current_object.system_role_id || !@current_user.has_system_role("admin")
			respond_to do |format|
					if @current_object.save
						if is_given_private_workspace
							@current_object.create_private_workspace_with_role('private_user')